cask_args appdir: "/Applications"

# Taps
tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "stripe/stripe-cli"

# Binaries
brew "aws/tap/aws-sam-cli"
brew "awscli"
brew "bat" # "cat" on steroids
brew "gnupg"
brew "pinentry-mac"
brew "python"
brew "stripe/stripe-cli/stripe"
brew "tree" # List directories in a tree structure

# Development
brew "node"
brew "yarn"

# Applications
cask "1password"
cask "alfred"
cask "appcleaner"
cask "docker"
cask "figma"
cask "firefox"
cask "github"
cask "google-backup-and-sync"
cask "google-chrome"
cask "imageoptim"
cask "insomnia"
cask "java"
cask "karabiner-elements"
cask "notion"
cask "postman"
cask "skype"
cask "visual-studio-code"

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto-condensed'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask "font-fira-code"