cask_args appdir: "/Applications"

tap "clementtsang/bottom"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "flux"
brew "n"
brew "node"
brew "subversion"
brew "yarn"
brew "clementtsang/bottom/bottom"

cask "1password"
cask "adobe-acrobat-reader"
cask "alfred"
cask "app-cleaner"
cask "discord"
cask "docker"
cask "firefox"
cask "font-fira-code"
cask "font-roboto-mono-for-powerline"
cask "github"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-teams"
cask "notion"
cask "postman"
cask "rectangle"
cask "skype"
cask "spotify"
cask "visual-studio-code"


# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto-condensed'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask "font-fira-code"
